<?php

/*
 * 插入排序—直接插入排序(Straight Insertion Sort)
 */
//
function InsertSort1(&$a, $n) {
	for ($i = 1; $i < $n; $i++) {
		if ($a[$i] < $a[$i - 1]) {   //若第i个元素大于i-1元素，直接插入。小于的话，移动有序表后插入  
			$j = $i - 1;
			$x = $a[$i];  //复制为哨兵，即存储待排序元素  
			$a[$i] = $a[$i - 1];  //先后移一个元素  
			while ($x < $a[$j]) {  //查找在有序表的插入位置  
				$a[$j + 1] = $a[$j];
				$j--;   //元素后移
			}
			$a[$j + 1] = $x;   //插入到正确位置  
		}
	}
}
// 我改的
function InsertSort2(&$a, $n) {
	for ($i = 1; $i < $n; $i++) {
		$x = $a[$i];
		$j = $i - 1;
		while ($x < $a[$j]) {  //查找在有序表的插入位置
			$a[$j + 1] = $a[$j];
			$a[$j] = $x;
			$j--;
		}
	}
}

$arr = array(3, 1, 5, 7, 2, 4, 9, 6, -1, 0, 0.3, 99,12,34,56,45,23,67,8676,345,224,335,666,223,55,35,24,7,3,7665,22,45,4546567,33,454,66,77,88,-1,-2);
InsertSort2($arr, count($arr));
var_dump($arr);


